## SQLite

In [2]:
! ls -ltrh test.sqlite

-rw-r--r--  1 davidchiu  staff     0B Sep 24 09:26 test.sqlite

In [5]:
import sqlite3 as lite
con = lite.connect('test.sqlite')
cur = con.cursor()
cur.execute('SELECT SQLITE_VERSION();')
data = cur.fetchone()
print(data)
con.close()

('3.24.0',)

In [6]:
with lite.connect('test.sqlite') as con:
    cur = con.cursor()
    cur.execute('SELECT SQLITE_VERSION();')
    data = cur.fetchone()
    print(data)

('3.24.0',)

In [7]:
import sqlite3 as lite 
with lite.connect("test.sqlite") as con: 
    cur = con.cursor() 
    cur.execute("DROP TABLE IF EXISTS PhoneAddress") 
    cur.execute("CREATE TABLE PhoneAddress(phone CHAR(10) PRIMARY KEY, address TEXT, name TEXT unique, age INT NOT NULL)") 
    cur.execute("INSERT INTO PhoneAddress VALUES('0912173381','United State','Jhon Doe',53)") 
    cur.execute("INSERT INTO PhoneAddress VALUES('0928375018','Tokyo Japan','MuMu Cat',6)") 
    cur.execute("INSERT INTO PhoneAddress VALUES('0957209108','Taipei','Richard',29)") 
    cur.execute("SELECT phone,address FROM PhoneAddress") 
    data = cur.fetchall() 
    for rec in data:
        print(rec)
        #print(rec[0], rec[1])

('0912173381', 'United State')
('0928375018', 'Tokyo Japan')
('0957209108', 'Taipei')

In [8]:
import sqlite3 as lite 
with lite.connect("test.sqlite") as con: 
    cur = con.cursor() 
    cur.execute("DROP TABLE IF EXISTS PhoneAddress") 
    cur.execute("CREATE TABLE PhoneAddress(phone CHAR(10) PRIMARY KEY, address TEXT, name TEXT unique, age INT NOT NULL)") 
    cur.execute("INSERT INTO PhoneAddress VALUES('0912173381','United State','Jhon Doe',53)") 
    cur.execute("INSERT INTO PhoneAddress VALUES('0928375018','Tokyo Japan','MuMu Cat',6)") 
    cur.execute("INSERT INTO PhoneAddress VALUES('0957209108','Taipei','Richard',29)") 
    cur.execute("SELECT phone,address FROM PhoneAddress") 
    data = cur.fetchone() 
    print(data)
    data2 = cur.fetchall() 
    print(data2)
        #print(rec[0], rec[1])

('0912173381', 'United State')
[('0928375018', 'Tokyo Japan'), ('0957209108', 'Taipei')]

In [9]:
import pandas
employee = [{'name':'Mary', 'age':23 , 'gender': 'F'},
            {'name':'John', 'age':33 , 'gender': 'M'}]
df = pandas.DataFrame(employee)
df

   age gender  name
0   23      F  Mary
1   33      M  John

In [11]:
with lite.connect('test.sqlite') as db:
    df.to_sql('employee', con = db, if_exists='replace' )

In [22]:
with lite.connect('test.sqlite') as db:
    df2 = pandas.read_sql_query('SELECT * FROM employee;', con = db, 
                                index_col= 'index')

In [23]:
df2

       age gender  name
index
0       23      F  Mary
1       33      M  John

## MySQL

In [ ]:
import pymysql

conn = pymysql.connect(host='127.0.0.1', \
    user='david',password='1qaz@WSX', \
    db='test',charset='utf8', \
    use_unicode=True)

cur = conn.cursor()
sql = "SELECT * FROM test"
cur.execute(sql)

data = cur.fetchall()
print(data)

conn.close()

In [ ]:
import psycopg2

conn = psycopg2.connect(database='test')

cur = conn.cursor()
sql = "SELECT * FROM test"
cur.execute(sql)

data = cur.fetchall()
print(data)

conn.close()

## SQL Injection

In [24]:
username = 'david'
password = '1qaz@WSX'
sql = "select * from user where username = '" + username + "' and password = '" + password + "';"
sql

"select * from user where username = 'david' and password = '1qaz@WSX';"

In [28]:
username = "' or 1=1; -- '"
password = 'qoo'

sql = "select * from user where username = '" + username + "' and password = '" + password + "';"
sql

"select * from user where username = '' or 1=1; -- '' and password = 'qoo';"

## SqlAlchemy

In [29]:
import sqlalchemy

# SQLite
from sqlalchemy import create_engine
connect_info = 'sqlite:///test.sqlite'
engine = create_engine(connect_info)

In [30]:
engine

Engine(sqlite:///test.sqlite)

In [34]:
from sqlalchemy.ext.declarative import declarative_base
Base = declarative_base()

from sqlalchemy import Column, Integer, String

class User(Base):
    __tablename__ = 'users'
    
    id = Column(Integer, primary_key=True)
    name = Column(String)
    fullname = Column(String)
    password = Column(String)
    
    # Defines to_string() representation 
    def __repr__(self):
        return "<User(name='%s', fullname='%s', password='%s')>" % (
            self.name, self.fullname, self.password)

In [35]:
Base.metadata.create_all(engine)

In [36]:
a = User(name = 'david', fullname= 'david chiu', password = '1qaz@WSX')

In [37]:
print(a)

<User(name='david', fullname='david chiu', password='1qaz@WSX')>

In [40]:
from sqlalchemy import Table, Column, Integer, String, MetaData, ForeignKey

metadata = MetaData()
user = Table('users2', metadata,
    Column('id', Integer, primary_key=True),
    Column('name', String),
    Column('fullname', String),
    Column('password', String),
)

metadata.create_all(engine)

In [41]:
from sqlalchemy.orm import sessionmaker
Session = sessionmaker(bind=engine)
session = Session()

In [42]:
duser = User(name='david', fullname='david chiu', password='edspassword')
print(duser)

<User(name='david', fullname='david chiu', password='edspassword')>

In [43]:
session.add(duser)

In [44]:
duser

In [45]:
session.commit()

In [46]:
our_user = session.query(User).filter_by(name='david').first()
our_user

In [47]:
duser == our_user

True

In [49]:
session.add_all([
    User(name='wendy', fullname='Wendy Williams', password='foobar'),
    User(name='mary', fullname='Mary Contrary', password='xxg527'),
    User(name='fred', fullname='Fred Flinstone', password='blah')])

duser.password = 'test123'

In [50]:
session.commit()

In [51]:
duser.name = 'davidson'
fake_user = User(name='fakeuser', fullname='Invalid', password='12345')
session.add(fake_user)

session.query(User).filter(User.name.in_(['davidson', 'fakeuser'])).all()

[<User(name='davidson', fullname='david chiu', password='test123')>,
 <User(name='fakeuser', fullname='Invalid', password='12345')>]

In [52]:
session.rollback()

In [53]:
session.query(User).all()

[<User(name='david', fullname='david chiu', password='test123')>,
 <User(name='wendy', fullname='Wendy Williams', password='foobar')>,
 <User(name='mary', fullname='Mary Contrary', password='xxg527')>,
 <User(name='fred', fullname='Fred Flinstone', password='blah')>]

In [55]:
for instance in session.query(User).order_by(User.id):
    print(instance)

<User(name='david', fullname='david chiu', password='test123')>
<User(name='wendy', fullname='Wendy Williams', password='foobar')>
<User(name='mary', fullname='Mary Contrary', password='xxg527')>
<User(name='fred', fullname='Fred Flinstone', password='blah')>

In [56]:
# Select
for name, fullname in session.query(User.name, User.fullname):
    print(name, fullname)

david david chiu
wendy Wendy Williams
mary Mary Contrary
fred Fred Flinstone

In [58]:
# equal
a = session.query(User).filter(User.name == 'david')
print(a)

SELECT users.id AS users_id, users.name AS users_name, users.fullname AS users_fullname, users.password AS users_password
FROM users
WHERE users.name = ?

In [59]:
a.all()

In [61]:
# not equal
a = session.query(User).filter(User.name != 'david')
print(a)

SELECT users.id AS users_id, users.name AS users_name, users.fullname AS users_fullname, users.password AS users_password
FROM users
WHERE users.name != ?

In [62]:
a.all()

[<User(name='wendy', fullname='Wendy Williams', password='foobar')>,
 <User(name='mary', fullname='Mary Contrary', password='xxg527')>,
 <User(name='fred', fullname='Fred Flinstone', password='blah')>]

In [63]:
# like
session.query(User).filter(User.name.like('%david%')).all()

In [64]:
# in
session.query(User).filter(User.name.in_(['david', 'wendy', 'jack'])).all()

[<User(name='david', fullname='david chiu', password='test123')>,
 <User(name='wendy', fullname='Wendy Williams', password='foobar')>]

In [65]:
# not in
session.query(User).filter(~User.name.in_(['david', 'wendy', 'jack'])).all()

[<User(name='mary', fullname='Mary Contrary', password='xxg527')>,
 <User(name='fred', fullname='Fred Flinstone', password='blah')>]

In [67]:
# or
from sqlalchemy import or_
session.query(User).filter(or_(User.name == 'david', User.name == 'wendy')).all()

[<User(name='david', fullname='david chiu', password='test123')>,
 <User(name='wendy', fullname='Wendy Williams', password='foobar')>]